%% Фокусатор в поперечный отрезок
clc
close all
clear all

% Вводные данные
lambda = 10.6e-3; % Длина волны, [мм]
k = (2*pi)/lambda;

N = 64;
f = 500; % [мм]
a = 12.8/2; % размер стороны апертуры фокусатора, [мм]
d = 0.1; % толщина отрезка, [мм]

% Параметры дискретизации
T = a/N; % мм - шаг 

Tr = a; %Ширина интервала рассмотрения

num = 1/(2*T); % Полуширина спектра
dnu = 1/Tr; % Шаг дискретизации по частоте

% Сетка дискретизации

u = -Tr/2:T:Tr/2 - T; % По координате Х в пл-ти ДОЭ
v = -Tr/2:T:Tr/2 - T; % По координате Y в пл-ти ДОЭ

nu = -num:dnu:num - dnu; % По частотам

%% Синтез фокусатора

for i = 1:N
    for j = 1:N
        %if (abs(u(i)) < a) && (abs(v(j)) < a)
            Phi(i,j) = (-k./(2*f)).*((1 - d/a)*u(i).^2 + v(i).^2);
        %end
    end
end

%% Результат дифракции
figure;
mesh(Phi);

Phi2 = exp(1i*pi*Phi);
E = abs(fftshift(fft2(fftshift(Phi2))));

figure;
mesh(u,v,E)
