%% Составной фокусатор в крест
clc
close all
clear all

% Вводные данные
lambda = 0.6328e-3; % Длина волны, [мм]
k = (2*pi)/lambda;

N = 512;
f = 5250; % [мм]
a = 25.6/2; % размер стороны апертуры фокусатора, [мм]
d = 1; % длина одной ветки креста, [мм]

% Параметры дискретизации
T = a/N; % мм - шаг 

Tr = a; %Ширина интервала рассмотрения

num = 1/(2*T); % Полуширина спектра
dnu = 1/Tr; % Шаг дискретизации по частоте

% Сетка дискретизации

u = -Tr/2:T:Tr/2 - T; % По координате Х в пл-ти ДОЭ
v = -Tr/2:T:Tr/2 - T; % По координате Y в пл-ти ДОЭ

nu = -num:dnu:num - dnu; % По частотам

%% Синтез фокусатора

for i = 1:N
    for j = 1:N
        if (u(i).*v(j) >= 0)
            Phi(i,j) = ((k*d)/(2*a*f))*u(i).^2;
        end
        if (u(i).*v(j) < 0)
           Phi(i,j) = ((k*d)/(2*a*f))*v(j)^2;
        end
    end
end

%% Результат дифракции
figure;
mesh(Phi);

Phi2 = exp(1i*pi*Phi);
figure;
mesh(u,v,angle(Phi2))

E = abs(fftshift(fft2(fftshift(Phi2)))).^2;

figure;
mesh(u,v,E)
